app/Controllers/Bahan_bp.php

  public function index()
  {
    $data = [
      'menu' => 'transaksi',
      'submenu' => 'bahan_bp',
      'title' => 'Pembebanan Bahan Body Repair',
      'wo_bp' => $this->wo_bpModel->orderBy('nowo')->findAll() //$wo
---
SELECT *
FROM `wo_bp`
ORDER BY `nowo`

  public function input_bahan_bp()
  {
    $id = $this->request->getVar('id');
    $row = $this->wo_bpModel->find($id);
    $data = [
      'title' => 'Update Bahan Body Repair',
      'wo_bp' => $this->wo_bpModel->find($id),
---
SELECT *
FROM `wo_bp`
WHERE `wo_bp`.`id` = '22'

  public function table_wo_bp()
  {
    $model = new wo_bpModel();
    $data['title'] = 'Work Order Body Repair';
    $data['wo_bp'] = $model->findAll();
---
SELECT *
FROM `wo_bp`