app/Controllers/Beli_part.php

  public function index()
  {
    $data = [
      'menu' => 'transaksi',
      'submenu' => 'beli_part',
      'submenu1' => 'spare_part',
      'title' => 'Pembelian Spare Part',
      'beli_part' => $this->beli_partModel->orderBy('nobeli')->findAll() //$wo
---
SELECT *
FROM `beli_part`
ORDER BY `nobeli`

  public function table_beli_part()
  {
    $model = new beli_partModel();
    $data['title'] = 'Pembelian Spare Part';
    $data['beli_part'] = $model->findAll();
---
SELECT *
FROM `beli_part`

  public function formedit()
  {
    if ($this->request->isAjax()) {
      $id = $this->request->getVar('id');
      $data = [
        'title' => 'Edit Data Pembelian Spare Part',
        'beli_part' => $this->beli_partModel->find($id),
---
SELECT *
FROM `beli_part`
WHERE `beli_part`.`id` = '8'