app/Controllers/Close_faktur_bp.php

SELECT *
FROM `faktur_bp`
ORDER BY `nowo`
---
  public function index()
  {
    $data = [
      'menu' => 'transaksi',
      'submenu' => 'close_faktur_bp',
      'title' => 'Close Faktur Body Repair',
      'faktur_bp' => $this->faktur_bpModel->orderBy('nowo')->findAll() //$wo

SELECT *
FROM `faktur_bp`
---
  public function table_faktur_bp()
  {
    $model = new faktur_bpModel();
    $data['title'] = 'Faktur Body Repair';
    $data['faktur_bp'] = $model->findAll();

SELECT *
FROM `faktur_bp`
WHERE `faktur_bp`.`id` = '41'
---
  public function cetakfaktur_bp($id)
  {
    $dompdf = new Dompdf();
    $row = $this->faktur_bpModel->find($id);
    $nofaktur = $row['nofaktur'];
    $nopolisi = $row['nopolisi'];
    $kdpemilik = $row['kdpemilik'];
    $kdsa = $row['kdsa'];
    if (!isset($kdsa)) {
      $kdsa = "";
    }
    $rowmobil = $this->tbmobilModel->getnopolisi($nopolisi);
    $kdmerek = $rowmobil['kdmerek'];
    $kdmodel = $rowmobil['kdmodel'];
    $kdtipe = $rowmobil['kdtipe'];
    $kdwarna = $rowmobil['kdwarna'];
    $kdjenis = $rowmobil['kdjenis'];


    $data = [
      'title' => 'Cetak faktur',
      'faktur_bp' => $this->faktur_bpModel->find($id),