app/Controllers/Estimasi_bp.php

SELECT *
FROM `estimasi_bp`
ORDER BY `noestimasi`
---
  public function index()
  {
    $data = [
      'menu' => 'transaksi',
      'submenu' => 'estimasi_bp',
      'title' => 'Estimasi Work Order Body Repair',
      'estimasi_bp' => $this->estimasi_bpModel->orderBy('noestimasi')->findAll() //$wo