app/Controllers/Login.php

  public function auth()
  {
    $session = session();
    $model = new UserModel();
    $email = $this->request->getVar('email');
    $password = $this->request->getVar('password');
    // $data = $model->where('email', $email)->where('aktif', 'Y')->first();
    $data = $model->where('email', $email)->first();
    if ($data) {
      $pass = $data['password'];
      $verify_pass = password_verify($password, $pass);
      if ($verify_pass) {
        $saplikasimodel = new SaplikasiModel();
        $saplikasi = $saplikasimodel->where('aktif', 'Y')->first();
---
SELECT *
FROM `user`
WHERE `email` = 'murod@honda-autoland.com'
 LIMIT 1
SELECT *
FROM `saplikasi`
WHERE `aktif` = 'Y'
 LIMIT 1