app/Controllers/Opl_bp.php

SELECT *
FROM `wo_bp`
ORDER BY `nowo`
---
  public function index()
  {
    $data = [
      'menu' => 'transaksi',
      'submenu' => 'opl_bp',
      'submenu1' => 'body_repair',
      'title' => 'Pembebanan OPL Body Repair',
      'wo_bp' => $this->wo_bpModel->orderBy('nowo')->findAll() //$wo

SELECT *
FROM `wo_bp`
---
  public function table_wo_bp()
  {
    $model = new wo_bpModel();
    $data['title'] = 'Work Order Body Repair';
    $data['wo_bp'] = $model->findAll();

UPDATE `wo_bp` SET `close_opl` = 1, `updated_at` = '2023-06-23 16:27:38'
WHERE `wo_bp`.`id` IN ('22')
---
  public function close_opl_bp()
  {
    if ($this->request->isAjax()) {
      $session = session();
      $id = $_POST['id'];
      $user = "Proses-" . $session->get('nama') . "-" . date('d-m-Y H:i:s');
      $simpandata = [
        'close_opl' => 1,
        'user_close_opl' => $user,
      ];
      // var_dump($simpandata);
      $this->wo_bpModel->update($id, $simpandata);