app/Controllers/Po_part.php

  public function index()
  {
    $data = [
      'menu' => 'transaksi',
      'submenu' => 'po_part',
      'submenu1' => 'spare_part',
      'title' => 'Purchase Order Part',
      'po_part' => $this->po_partModel->orderBy('nopo')->findAll() //$wo
---
SELECT *
FROM `po_part`
ORDER BY `nopo`

  public function table_po_part()
  {
    $model = new po_partModel();
    $data['title'] = 'Purchase Order Part';
    $data['po_part'] = $model->findAll();
---
SELECT *
FROM `po_part`

  public function formedit()
  {
    if ($this->request->isAjax()) {
      $id = $this->request->getVar('id');
      $data = [
        'title' => 'Edit Data Purchase Order (PO)',
        'po_part' => $this->po_partModel->find($id),
---
SELECT *
FROM `po_part`
WHERE `po_part`.`id` = '11'