app/Models/MemombrModel.php

SELECT COUNT(*) AS `numrows`
FROM `memombr`
---
  public function jumlah_record()
  {
    return $this->db->table('memombr')->countAllResults();