app/Models/MohfakturModel.php

SELECT COUNT(*) AS `numrows`
FROM `mohfaktur`
---
  public function jumlah_record()
  {
    return $this->db->table('mohfaktur')->countAllResults();