app/Models/PengajuandiscountModel.php

SELECT COUNT(*) AS `numrows`
FROM `pengajuandiscount`
---
  public function jumlah_record()
  {
    return $this->db->table('pengajuandiscount')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `pengajuandiscount`
WHERE `status_approv_dir` = 'SETUJUI'
---
  public function jumlah_record_approved()
  {
    $builder = $this->db->table('pengajuandiscount');
    return $builder->where('status_approv_dir', 'SETUJUI')->countAllResults();