app/Models/TbcustomerModel.php

SELECT *
FROM `tbcustomer`
WHERE `kode` = '20221100002'
 LIMIT 1
---
  public function getkdcustomer($kode = false)
  {
    if ($kode == false) {
      return $this->findAll();
    }
    return $this->where('kode', $kode)->first();