app/Models/TbjenisModel.php

SELECT *
FROM `tbjenis`
WHERE `kode` = 'MPV'
 LIMIT 1
---
  public function getkode($kode = false)
  {
    if ($kode == false) {
      return $this->orderBy('kode')->findAll();
    }
    return $this->where('kode', $kode)->first();