app/Models/TbmerekModel.php

SELECT *
FROM `tbmerek`
WHERE `kode` = '01'
 LIMIT 1
---
  public function getkode($kode = false)
  {
    if ($kode == false) {
      return $this->orderBy('kode')->findAll();
    }
    return $this->where('kode', $kode)->first();