app/Models/TbmobilModel.php

  public function getnopolisi($nopolisi = false)
  {
    if ($nopolisi == false) {
      // $builder = $this->db->table("tbmobil");
      // $builder->select('*')->orderBy('nopolisi');
      $builder = $this->db->table("tbmobil as tbmobil");
      $builder->select('tbmobil.*, tbmerek.nama as nmmerek, tbtipe.nama as nmtipe');
      $builder->join('tbmerek as tbmerek', 'tbmerek.kode = tbmobil.kdmerek', 'left');
      $builder->join('tbtipe as tbtipe', 'tbtipe.kode = tbmobil.kdtipe', 'left');
      return $builder->get()->getResult();
      // return $this->orderBy('nopolisi')->findAll();
    }
    return $this->where('nopolisi', $nopolisi)->first();
---
SELECT `tbmobil`.*, `tbmerek`.`nama` as `nmmerek`, `tbtipe`.`nama` as `nmtipe`
FROM `tbmobil` as `tbmobil`
LEFT JOIN `tbmerek` as `tbmerek` ON `tbmerek`.`kode` = `tbmobil`.`kdmerek`
LEFT JOIN `tbtipe` as `tbtipe` ON `tbtipe`.`kode` = `tbmobil`.`kdtipe`
SELECT *
FROM `tbmobil`
WHERE `nopolisi` = 'B123'
 LIMIT 1