app/Models/TbmodelModel.php

SELECT *
FROM `tbmodel`
WHERE `kode` = 'CT'
 LIMIT 1
---
  public function getkode($kode = false)
  {
    if ($kode == false) {
      $builder = $this->db->table("tbmodel as tbmodel");
      $builder->select('tbmodel.id, tbmodel.kode as kdmodel,tbmodel.nama as nmmodel,tbmodel.user,tbmodel.kdmerek,tbmerek.nama as nmmerek,tbmodel.aktif as aktif');
      $builder->join('tbmerek as tbmerek', 'tbmerek.kode = tbmodel.kdmerek', 'left');
      return $builder->get()->getResult();
      // return $this->orderBy('kode')->findAll();
    }
    return $this->where('kode', $kode)->first();