app/Models/TbtipeModel.php

  public function getkode($kode = false)
  {
    if ($kode == false) {
      $builder = $this->db->table("tbtipe as tbtipe");
      $builder->select('tbtipe.id, tbtipe.kode as kdtipe,tbtipe.nama as nmtipe,tbtipe.user,tbmodel.kode as kdmodel,tbmodel.nama as nmmodel,tbtipe.aktif as aktif');
      $builder->join('tbmodel as tbmodel', 'tbtipe.kdmodel = tbmodel.kode', 'left');
      return $builder->get()->getResult();
      // return $this->orderBy('kode')->findAll();
    }
    return $this->where('kode', $kode)->first();
---
SELECT *
FROM `tbtipe`
WHERE `kode` = 'CTH'
 LIMIT 1