app/Models/TbwarnaModel.php

SELECT *
FROM `tbwarna`
WHERE `kode` = '01'
 LIMIT 1
---
  public function getkode($kode = false)
  {
    if ($kode == false) {
      $builder = $this->db->table("tbwarna");
      return $builder->get()->getResult();
      // return $this->orderBy('kode')->findAll();
    }
    return $this->where('kode', $kode)->first();